package org.rx.fl.service.command;

public class MessageFormat {
    public static final String orderList="一一一一订 单 列 表一一一一\n";
    public static final String rebindOrder = "一一一一订 单 绑 定一一一一\n" +
            "    付款成功后如果2分钟内没有订单记录再发送订单编号绑定，订单编号在购买的商品详细页能查看到。";
//
//
//
//    一一一一付 费 成 功一一一一
//    运动鞋垫弹力男女夏季减震加厚吸汗防臭透气鞋垫软篮球跑步弹力软
//    订单编号:
//            305357312384863943
//    付费金额:13.9圆
//    红包补贴:1.83圆
//
//    当前可提现金额:0圆
//    当前未收货金额4.78圆
//
//-------------------------------
//    亲 收货成功后，回复 提现  两个字，我给你补贴红包
//
//    将机器人名片推荐给好友，永久享受返利提成
//
//
//
//    一一一一收 货 成 功一一一一
//    运动鞋垫弹力男女夏季减震加厚吸汗防臭透气鞋垫软篮球跑步弹力软
//    订单编号:
//            305357312384863943
//    付费金额:13.90圆
//    红包补贴:1.83圆
//
//    可提现金额:4.01圆
//    未收货金额:0.98圆
//    总成功数量:27单
//-------------------------------
//    回复 提现  两个字，给你补贴红包
//            补贴红包已转入可提现金额
}
