package org.rx.fl.service.message;

public class MessageFormat {
    //↓
    public static final String userDashboard = "一一一一个 人 信 息一一一一\n" +
            "总提现金额: %.2f元\n" +
            "可提现金额: %.2f元\n" +
            "  冻结金额: %.2f元\n" +
            "未收货金额: %.2f元\n" +
            "总成功订单: %s单\n" +
            "\n" +
            "签到次数: %s次\n" +
            "签到奖励: %.2f元\n" +
            "推广人数: %s人\n" +
            "推广奖励: %.2f元\n" +
            "  提现中: %.2f元";
    public static final String bindPayment = "一一一一绑 定 账 号一一一一\n" +
            "亲，回复如下格式绑定:\n" +
            "姓名***支付宝*********\n" +
            "\n" +
            "如:姓名小范支付宝15888888888\n" +
            "\n" +
            "    本绑定只是用于提现到支付宝时使用，支付宝账号应为手机号码或者邮箱地址，如不清楚可打开支付宝APP查看自己的账号。";
    public static final String bindPayment_Ok = "一一一一绑 定 成 功一一一一\n" +
            "    亲，您已成功绑定！";
    public static final String bindPayment_Fail = "一一一一绑 定 失 败一一一一\n" +
            "    亲，您已绑定过支付宝，如果支付宝或者姓名回复错误，请回复新的支付宝和姓名，系统会在24小时内为您处理。";
    public static final String withdraw_Ok = "一一一一申 请 成 功一一一一\n" +
            "申请提现金额: %.2f元\n" +
            "    冻结金额: %.2f元\n" +
            "\n" +
            "    亲，为方便您更快更便捷的第一时间收到返现，请您尽快绑定支付宝账号，系统会在24小时内处理，处理后会有消息通知，请注意查看。";
    public static final String withdraw_Fail1 = "一一一一申 请 失 败一一一一\n" +
            "申请提现失败！\n" +
            "    亲，您的可提现金额为0元，请下单后再来申请。";
    public static final String withdraw_Fail2 = "一一一一申 请 失 败一一一一\n" +
            "申请提现失败！\n" +
            "    亲，您已申请过提现:[%.2f元]，请等提现成功后再继续申请。";
    public static final String feedback = "一一一一提 交 问 题一一一一\n" +
            "亲，当您在使用中遇到任何问题时可以使用本命令提交问题，客服会在24小时内为您处理。\n" +
            "回复格式:\n" +
            "反映问题************\n" +
            "\n" +
            "注:本命令提交后需要等客服处理后才能再次提交，请将问题表达清楚，便于客服处理。";
    public static final String feedback_Ok="一一一一提 交 成 功一一一一\n" +
            "    问题提交成功,系统会在24小时内处理,处理结果会已消息形式通知";
    public static final String feedback_Fail="一一一一提 交 失 败一一一一\n" +
            "    你已经提交过问题，请等待问题处理完毕后再提交";

    private String x = "一一一一订 单 绑 定一一一一\n" +
            "    付费成功后如果2分钟内没有收到付费成功提示再发送订单编号绑定,订单编号在购买的商品详细页能查看到";
    一一一一帮 助 信 息一一一一

[个人信息]---查看账户信息
[绑定]--------关联上支付宝
[提现]--------提取返利佣金
[反映问题]---人工处理问题
[关联下级]---邀请绑定下线
[详细订单]---查看历史订单
[订单绑定]---找回丢失订单
[签到]--------签到随机奖励

    请亲输入[ ]内文字



    一一一一付 费 成 功一一一一
    运动鞋垫弹力男女夏季减震加厚吸汗防臭透气鞋垫软篮球跑步弹力软
    订单编号:
            305357312384863943
    付费金额:13.9圆
    红包补贴:1.83圆

    当前可提现金额:0圆
    当前未收货金额4.78圆

-------------------------------
    亲 收货成功后，回复 提现  两个字，我给你补贴红包

    将机器人名片推荐给好友，永久享受返利提成



    一一一一收 货 成 功一一一一
    运动鞋垫弹力男女夏季减震加厚吸汗防臭透气鞋垫软篮球跑步弹力软
    订单编号:
            305357312384863943
    付费金额:13.90圆
    红包补贴:1.83圆

    可提现金额:4.01圆
    未收货金额:0.98圆
    总成功数量:27单
-------------------------------
    回复 提现  两个字，给你补贴红包
            补贴红包已转入可提现金额
    String x = "一一一一签 到 成 功一一一一\n" +
            "\n" +
            "本次签到获得:0.07元\n" +
            "累计签到:93次\n" +
            "累计奖励:5.35元\n" +
            "当前可提现金额:4.22元\n" +
            "------------------------------------------\n" +
            "更多优惠券请点击 ：http://t.cn/EbvlGiG\n" +
            "--------------------------------\n" +
            "\n" +
            "荭苞来啦\n" +
            "吱富寳搜索：8775980\n" +
            "最高99";

    x="一一一一签 到 失 败一一一一\n"+
            "    本次签到失败!\n"+
            "    今天已经签到过了,请明天再来";
}
